app/views/api/playlists/_playlist.json.jbuilder

SELECT "playlist_songs"."song_id", "playlist_songs"."id" FROM "playlist_songs" WHERE "playlist_songs"."playlist_id" = $1  [["playlist_id", 1]]
---
json.set! 'playlist_songs' do
    json.array! playlist.playlist_songs.pluck(:id, :song_id).map { |id, song_id| { playlist_song_id: id, song_id: song_id } }