app/controllers/api/playlist_songs_controller.rb

SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    @playlist_song = PlaylistSong.find(params[:id])