app/controllers/api/playlists_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        @playlist = current_user.playlists.find_by_id(params[:id])

INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My Playlist #5"], ["user_id", 1], ["created_at", "2023-12-21 23:54:09.100486"], ["updated_at", "2023-12-21 23:54:09.100486"]]
---
    def create
        @playlist = current_user.playlists.new(playlist_params)

        if @playlist.save

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "playlists" SET "name" = $1, "updated_at" = $2 WHERE "playlists"."id" = $3  [["name", "k"], ["updated_at", "2023-12-22 03:41:55.271537"], ["id", 9]]
---
    def update
        @playlist = Playlist.find(params[:id])
        @playlist.update(playlist_params)