app/controllers/api/playlist_songs_controller.rb

  def show
    @playlist_song = PlaylistSong.find(params[:id])
---
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @playlist_song = PlaylistSong.new(playlist_song_params)
    if @playlist_song.save
---
INSERT INTO "playlist_songs" ("playlist_id", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["playlist_id", 4], ["song_id", 2], ["created_at", "2023-12-21 23:53:47.603791"], ["updated_at", "2023-12-21 23:53:47.603791"]]

  def destroy
    @playlist_song = Playlist.find(params[:id])
    @playlist_song.destroy
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "playlist_songs" WHERE "playlist_songs"."id" = $1  [["id", 4]]