app/controllers/api/songs_controller.rb

SELECT "songs".* FROM "songs"
---
def index
    if Rails.cache.exist?('all_songs')
      Rails.logger.info "Fetching songs from cache"
      @songs = Rails.cache.read('all_songs')
    else
      Rails.logger.info "Fetching songs from database"
      @songs = Song.all.to_a