app/views/api/albums/index.json.jbuilder

SELECT "songs"."id" FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 1]]
---
    json.set! 'album_songs' do
      json.array! album.songs.pluck(:id)