app/views/api/albums/show.json.jbuilder

    json.set! 'album_songs' do
      json.array! @album.songs.pluck(:id)
---
SELECT "songs"."id" FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 1]]

json.songs do
  @album.songs.each do |song|
---
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 1]]