app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-12-22 00:08:56.227382"], ["id", 1]]
---
    def reset_session_token!
        self.update!(session_token: generate_unique_session_token)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        loop do
        token = SecureRandom.base64
        return token unless User.exists?(session_token: token)